app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def index
    @users = User.find :all

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def edit
    @user = User.find(params[:id])